public/project/ex-libris/index.html
<!DOCTYPE html>
<html lang="en-us" dir="ltr">
<head>  <meta charset="utf-8" />
<meta name="viewport" content="width=device-width" />
<link
  rel="icon"
  type="image/png"
  href="http://localhost:1313/porfolio-hugo//icons/favicon-96x96.png"
  sizes="96x96"
/>
<link
  rel="icon"
  type="image/svg+xml"
  href="http://localhost:1313/porfolio-hugo//icons/favicon.svg"
/>
<link rel="shortcut icon" href="http://localhost:1313/porfolio-hugo//icons/favicon.ico" />
<link
  rel="apple-touch-icon"
  sizes="180x180"
  href="http://localhost:1313/porfolio-hugo//icons/apple-touch-icon.png"
/>
<link rel="manifest" href="http://localhost:1313/porfolio-hugo//icons/site.webmanifest" />
<title>
  Ex Libris | Software Engineering Portfolio
</title>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/normalize.css" />

    <link rel="stylesheet" href="/porfolio-hugo/css/main.css">
 


</head>
<body>
  <header>
    <a href="http://localhost:1313/porfolio-hugo/">
  <h3>Software Engineering Portfolio</h3>
</a>

  </header>
  <main>
    
<section>
  <main style="line-height: 1.5; max-width: 678px">
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Building Ex Libris: A Virtual Bookshelf with Hugo
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Overview
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Ex Libris is a virtual bookshelf designed to help book lovers track their reading journey. Built as a static website using Hugo, the site allows users to catalog books, manage reading progress, and discover new titles. Ex Libris focuses on providing a visually appealing and easy-to-navigate platform to maintain a personal book collection, whether for tracking books you&#39;ve read, are currently reading, or plan to read.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Challenges
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li><strong>Static Site Limitations:</strong> Designing a dynamic user experience within the constraints of a static site generator.</li>
<li><strong>Data Management:</strong> Ensuring books can be added, categorized, and displayed with minimal manual intervention.</li>
<li><strong>Scalability:</strong> Allowing users to grow their virtual bookshelf without performance issues as their collections expand.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Solutions
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li><strong>Hugo as a Static Site Generator:</strong> Leveraged Hugo’s fast build times to create a performant site that loads instantly, even with large book collections.</li>
<li><strong>Markdown Integration:</strong> Used Markdown for easy content creation, allowing books to be added with simple YAML front matter for easy categorization and metadata.</li>
<li><strong>Custom Shortcodes:</strong> Created custom shortcodes in Hugo to allow books to be displayed with images, descriptions, and additional metadata like author and genre.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Implementation
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ol>
<li><strong>Book Management System:</strong> Designed a YAML-based system within Hugo to manage books, storing details like title, author, genre, and reading status.</li>
<li><strong>Virtual Bookshelf Display:</strong> Developed a clean, grid-style bookshelf layout to display books in various categories, including “Currently Reading,” “Read,” and “Want to Read.”</li>
<li><strong>Progress Tracking:</strong> Incorporated progress tracking for books, including start and end dates, as well as a rating system.</li>
<li><strong>Future Enhancements:</strong> Planned integration with external book databases (like Goodreads) to auto-import book data and sync reading progress.</li>
</ol>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Features
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li><strong>Categorize Books:</strong> Organize your books into sections like &#34;Read,&#34; &#34;Currently Reading,&#34; and &#34;To Read.&#34;</li>
<li><strong>Progress Tracking:</strong> Track your reading progress with start/end dates and personal ratings for each book.</li>
<li><strong>Customizable Design:</strong> Hugo themes allow for easy customization of the site’s look and feel, giving users control over how their bookshelf appears.</li>
<li><strong>Search and Filter:</strong> The bookshelf features basic search and filtering functionality to help users quickly find books by title, author, or genre.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Technologies Used
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li><strong>Hugo:</strong> The static site generator that powers Ex Libris, known for fast site building and performance.</li>
<li><strong>Markdown and YAML:</strong> Used for managing books and metadata, allowing for easy content addition and updates.</li>
<li><strong>Custom Shortcodes:</strong> To display book information, images, and progress tracking directly within pages.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Conclusion
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Ex Libris serves as an elegant and functional virtual bookshelf, allowing users to keep track of their reading history and goals. By leveraging Hugo’s speed and flexibility, the site offers a simple, static solution for managing books and showcasing personal libraries. Whether you&#39;re a casual reader or an avid book collector, Ex Libris is a great tool for organizing your literary journey.</p>
</div>
</div>
</div>
</div>
</main>
</section>

  </main>
  <footer>
    <p>Copyright 2025. All rights reserved.</p>

  </footer>
</body>
</html>
